# написати програму для отримання зрізу рядка
# Присвойте змінній довільний рядок в та отримайте з неї наступні зрізи, якщо довжина слова достатня для виконання операції зрізу.
# Отримати послідовність символів від 12-го символа по 15-й (15-й символ не включається).
def cutStr():
    return


# написати програму для обробки слів
# Задано слово, в якому є дві і більше однакові літери. Скласти програму, яка їх визначає і виводить на екран.
def analyzeWords():
    return


# написати програму для обробки рядків
# Задано речення. Скласти програму, яка визначає і виводить на екран кількість слів, які розпочинаються з літери «н».
def analyzeStr():
    return